Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/СозданиеВедомостейПрочихДоходов/СозданиеВедомостейПрочихДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеВедомостейПрочихДоходов</name>
</mdclass:DataProcessor>

Комплексная_автоматизация_2_МОМ_2019/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентамиАкционерами/ВзаиморасчетыСКонтрагентамиАкционерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентамиАкционерами</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГруппаНачисленияУдержанияВыплаты</name>
    <type>
      <types>EnumRef.ГруппыНачисленияУдержанияВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособРасчетов</name>
    <type>
      <types>EnumRef.СпособыРасчетовСФизическимиЛицами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументОснованиеВыплатыПрочихДоходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/СпособыРасчетовСФизическимиЛицами/СпособыРасчетовСФизическимиЛицами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетовСФизическимиЛицами</name>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудникам</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/СпособыВыплатыПрочихДоходов/СпособыВыплатыПрочихДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыплатыПрочихДоходов</name>
  <enumValues>
    <name>ВыплатыБывшимСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаПрочихДоходов</name>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудникам</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ВидыДоходовИсполнительногоПроизводства/ВидыДоходовИсполнительногоПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоходовИсполнительногоПроизводства</name>
  <enumValues>
    <name>ДоходыБезОграниченияВзысканий</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВознаграждения</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/СозданиеВедомостейПрочихДоходов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проверка_возможности_создания_ведомостей 

Функция МожноСоздатьВедомостиПоРасчетномуДокументу(РасчетныйДокумент) Экспорт
	
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйДокумент, "Проведен") Тогда
		ТекстСообщения = НСтр("ru = 'Выплата возможна только по проведенному документу'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетныйДокумент", РасчетныйДокумент);
	
	// Должны остаться суммы к выплате по документу.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Остатки(, ДокументОснование = &РасчетныйДокумент) КАК Остатки
	|ГДЕ
	|	Остатки.СуммаВзаиморасчетовОстаток > 0";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()Тогда
		ТекстСообщения = НСтр("ru = 'По документу не осталось сумм к выплате'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь
	КонецЕсли;
	
	Возврат Истина
	
КонецФункции

#КонецОбласти

#Область Создание_ведомостей 

Функция ПараметрыСозданияВедомостейПоРасчетномуДокументу() Экспорт
	
	ПараметрыСозданияВедомостейПоРасчетномуДокументу = Новый Структура;
	ПараметрыСозданияВедомостейПоРасчетномуДокументу.Вставить("УникальныйИдентификаторФормы");
	ПараметрыСозданияВедомостейПоРасчетномуДокументу.Вставить("ДатаВыплаты");
	ПараметрыСозданияВедомостейПоРасчетномуДокументу.Вставить("ВРазрезеИсточников");
	ПараметрыСозданияВедомостейПоРасчетномуДокументу.Вставить("ВидМестаВыплаты");
	ПараметрыСозданияВедомостейПоРасчетномуДокументу.Вставить("ЗарплатныйПроект");
	
	Возврат ПараметрыСозданияВедомостейПоРасчетномуДокументу;
	
КонецФункции

Функция СоздатьВедомостиПоРасчетномуДокументу(РасчетныйДокумент, ПараметрыСоздания) Экспорт
	
	СписокВедомостей = НовыйСписокВедомостей();
	
	ВыборкаКлючейВедомостей = КлючиВедомостейПоРасчетномуДокументу(РасчетныйДокумент, ПараметрыСоздания);
	
	ПоказыватьСтатьиРасходов		= ПараметрыСоздания.ВРазрезеИсточников И ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении");
	ПоказыватьСтатьиФинансирования	= ПараметрыСоздания.ВРазрезеИсточников И ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата");
	
	ТипВедомости = "";
	Пока ВыборкаКлючейВедомостей.Следующий() Цикл
		
		Ведомость = НоваяВедомостьПоРасчетномуДокументу(РасчетныйДокумент, ВыборкаКлючейВедомостей, ПараметрыСоздания);
		Если Ведомость = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Ведомость.ЗаполнитьВыплаты();
		
		Строка = СписокВедомостей.Добавить();
		Строка.Адрес = ПоместитьВоВременноеХранилище(ОбщегоНазначения.ЗначениеВСтрокуXML(Ведомость), ПараметрыСоздания.УникальныйИдентификаторФормы);
		Строка.Сумма = Ведомость.Выплаты.Итог("КВыплате");
		Строка.Сотрудники = ЗарплатаКадры.КраткийСоставФизЛиц(Ведомость.Выплаты.ВыгрузитьКолонку("ФизическоеЛицо"), Ведомость.Дата);
		
		Если ПустаяСтрока(ТипВедомости) Тогда
			ТипВедомости = Ведомость.Метаданные().Синоним;
		КонецЕсли;
		Строка.Тип = ТипВедомости;
		
		Если ПоказыватьСтатьиФинансирования И ПоказыватьСтатьиРасходов Тогда
			Финансирование = СтрШаблон(
					НСтр("ru = '%1(%2)'"),
					ВедомостьНаВыплатуЗарплатыФормыПовтИсп.ПредставленияСтатейФинансирования()[Ведомость.СтатьяФинансирования],
					ВедомостьНаВыплатуЗарплатыФормыПовтИсп.ПредставленияСтатейРасходов()[Ведомость.СтатьяРасходов]);
		ИначеЕсли ПоказыватьСтатьиФинансирования Тогда
			Финансирование = ВедомостьНаВыплатуЗарплатыФормыПовтИсп.ПредставленияСтатейФинансирования()[Ведомость.СтатьяФинансирования];
		ИначеЕсли ПоказыватьСтатьиРасходов Тогда
			Финансирование = ВедомостьНаВыплатуЗарплатыФормыПовтИсп.ПредставленияСтатейРасходов()[Ведомость.СтатьяРасходов];
		Иначе
			Финансирование = "";
		КонецЕсли;
		Строка.Финансирование = Финансирование;
		
	КонецЦикла;
	
	Возврат СписокВедомостей
	
КонецФункции

Функция НовыйСписокВедомостей()
	
	ТаблицаВедомостей = Новый ТаблицаЗначений;
	ТаблицаВедомостей.Колонки.Добавить("Адрес");
	ТаблицаВедомостей.Колонки.Добавить("Тип");
	ТаблицаВедомостей.Колонки.Добавить("Сумма");
	ТаблицаВедомостей.Колонки.Добавить("Сотрудники");
	ТаблицаВедомостей.Колонки.Добавить("Финансирование");
	
	Возврат ТаблицаВедомостей
	
КонецФункции

Функция КлючиВедомостейПоРасчетномуДокументу(РасчетныйДокумент, ПараметрыСоздания)
	
	СпособВыплаты = ОбщегоНазначения.МенеджерОбъектаПоСсылке(РасчетныйДокумент).СпособВыплатыПрочихДоходов();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетныйДокумент",  РасчетныйДокумент);
	Запрос.УстановитьПараметр("ВРазрезеИсточников", ПараметрыСоздания.ВРазрезеИсточников);
	Запрос.УстановитьПараметр("СпособВыплаты", СпособВыплаты);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Взаиморасчеты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Взаиморасчеты.СпособРасчетов = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетовСФизическимиЛицами.ДивидендыСотрудникам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПрочихДоходов.ДивидендыСотрудникам)
	|		КОГДА Взаиморасчеты.СпособРасчетов = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетовСФизическимиЛицами.Дивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПрочихДоходов.Дивиденды)
	|		ИНАЧЕ &СпособВыплаты
	|	КОНЕЦ КАК СпособВыплаты,
	|	ВЫБОР
	|		КОГДА &ВРазрезеИсточников
	|			ТОГДА Взаиморасчеты.СтатьяФинансирования
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяФинансирования,
	|	ВЫБОР
	|		КОГДА &ВРазрезеИсточников
	|			ТОГДА Взаиморасчеты.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРасходов,
	|	Взаиморасчеты.Период КАК ПериодРегистрации
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.Регистратор = &РасчетныйДокумент";
	
	ВыборкаПоРасчетномуДокументу = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаПоРасчетномуДокументу
	
КонецФункции

Функция НоваяВедомостьПоРасчетномуДокументу(РасчетныйДокумент, КлючВедомости, ПараметрыСоздания)
	
	ДокументМенеджер = ВзаиморасчетыПоПрочимДоходам.МенеджерДокументаВедомостьПоВидуМестаВыплаты(ПараметрыСоздания.ВидМестаВыплаты); 
	Если ДокументМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ведомость = ДокументМенеджер.СоздатьДокумент();
	
	ДанныеЗаполнения = ВедомостьПрочихДоходов.ДанныеЗаполненияВедомости();
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Шапка, КлючВедомости);
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Шапка, ПараметрыСоздания);
	ДанныеЗаполнения.Шапка.Дата = ПараметрыСоздания.ДатаВыплаты;
	ДанныеЗаполнения.Основания.Добавить(РасчетныйДокумент);
	
	Ведомость.СтатьяФинансирования	= КлючВедомости.СтатьяФинансирования;
	Ведомость.СтатьяРасходов		= КлючВедомости.СтатьяРасходов;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Ведомость, "ВидДоходаИсполнительногоПроизводства") 
		И ВидыДоходовИсполнительногоПроизводстваКлиентСервер.ВидДоходаОбязателенДляБанков(ПараметрыСоздания.ДатаВыплаты)Тогда
		Ведомость.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ДоходыБезОграниченияВзысканий;
	КонецЕсли;	
	
	Ведомость.Заполнить(ДанныеЗаполнения);
	
	Возврат Ведомость
	
КонецФункции
	
#КонецОбласти

#Область Сохранение_ведомостей 

Процедура СохранитьВедомостиНаСервере(СписокВедомостей, РежимЗаписи)	Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаСпискаВедомостей Из СписокВедомостей Цикл
		СтрокаXML = ПолучитьИзВременногоХранилища(СтрокаСпискаВедомостей.Адрес);
		Ведомость = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
		Ведомость.Записать(РежимЗаписи);
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецЕсли
